Data/Raw data/Varying threads (only workload A, constant record count, target)/mongo_threads/threads_8/output.txt
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 2500
[OVERALL], Throughput(ops/sec), 2000.0
[TOTAL_GCS_PS_Scavenge], Count, 5
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 34
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.3599999999999999
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 34
[TOTAL_GC_TIME_%], Time(%), 1.3599999999999999
[READ], Operations, 4746
[READ], AverageLatency(us), 2680.8857985672144
[READ], MinLatency(us), 236
[READ], MaxLatency(us), 145151
[READ], 95thPercentileLatency(us), 7183
[READ], 99thPercentileLatency(us), 13271
[READ], Return=OK, 4746
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 678.0
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 5419
[CLEANUP], 95thPercentileLatency(us), 5419
[CLEANUP], 99thPercentileLatency(us), 5419
[UPDATE], Operations, 254
[UPDATE], AverageLatency(us), 3007.48031496063
[UPDATE], MinLatency(us), 392
[UPDATE], MaxLatency(us), 50559
[UPDATE], 95thPercentileLatency(us), 8051
[UPDATE], 99thPercentileLatency(us), 16863
[UPDATE], Return=OK, 254